design_model/src/main/resources/结构型模式/适配器模式/适配器模式.md
```mermaid
classDiagram
    class Adaptee {
        +specificRequest()
    }
    class Adapter {
        +request()
    }
    class Target {
        <<Abstract>>
        +request()*
    }
    class Client {
    }
    Adapter --|> Target
    Adapter --> Adaptee : adaptee
    Adapter --|> Adaptee : class adaptee(类适配模式)
    Client ..> Target
```
